In [15]:
import numpy as np

In [21]:
l1 = [12,3,4,2,4,5,3,23,54,6,76,89]
l1

[12, 3, 4, 2.4, 4, 5, 3, 23, 54, 6, 76, 89, 'A']

In [22]:
narr1 = np.array(l1)

In [23]:
type(narr1)

numpy.ndarray

In [24]:
narr1

array(['12', '3', '4', '2.4', '4', '5', '3', '23', '54', '6', '76', '89',
       'A'], dtype='<U32')

In [37]:
import pandas as pd
l2 = [12,3,0,-1,6,3,0,-5,6,0,0,4,2,4,5,3,23,54,6,76,89]
l2S = pd.Series(l2)
l2S

0     12
1      3
2      0
3     -1
4      6
5      3
6      0
7     -5
8      6
9      0
10     0
11     4
12     2
13     4
14     5
15     3
16    23
17    54
18     6
19    76
20    89
dtype: int64

# Binning in python

In [40]:
pd.Series(np.where((l2S == 0),"zero",np.where((l2S > 0) , "pos" ,"neg")))

0      pos
1      pos
2     zero
3      neg
4      pos
5      pos
6     zero
7      neg
8      pos
9     zero
10    zero
11     pos
12     pos
13     pos
14     pos
15     pos
16     pos
17     pos
18     pos
19     pos
20     pos
dtype: object

# Data Manipulation using pandas

In [51]:
#creation of data frame using dictionary
import pandas as pd
data = pd.DataFrame({'Country': ['Russia','Colombia','Chile','Equador','Nigeria'],
                    'Rank':[121,40,100,130,11]})

In [52]:
data.describe()

             Rank
count    5.000000
mean    80.400000
std     52.300096
min     11.000000
25%     40.000000
50%    100.000000
75%    121.000000
max    130.000000

In [58]:
data.quantile([0,0.25,0.50,0.75,1])
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
Country    5 non-null object
Rank       5 non-null int64
dtypes: int64(1), object(1)
memory usage: 160.0+ bytes

In [59]:
data = pd.DataFrame({'group':['a', 'a', 'a', 'b','b', 'b', 'c', 'c','c'],'ounces':[4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [60]:
data

  group  ounces
0     a     4.0
1     a     3.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0

In [73]:
data.sort_values(["group","ounces"], ascending = [True, True])

  group  ounces
1     a     3.0
0     a     4.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0

In [74]:
data = pd.DataFrame({'k1':['one']*3 + ['two']*4, 'k2':[3,2,1,3,3,4,4]})

In [76]:
data.sort_values(["k2"])

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
4  two   3
5  two   4
6  two   4

In [78]:
data.drop_duplicates("k1")

    k1  k2
0  one   3
3  two   3

In [79]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami','corned beef', 'Bacon', 'pastrami', 'honey ham','nova lox'],
                 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [80]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [96]:
data  = data.assign(new_variable = data["ounces"] * 10)

In [99]:
data.drop("new_variable", axis = "columns")

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [100]:
data["ounces"].replace(4.0,40.0);

In [102]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [111]:
data.rename(index = {"Ohio" : "Sanf", "Colorado" : "Panarado"} , columns = {"one":"one_new"})

          one_new  two  three  four
Sanf            0    1      2     3
Panarado        4    5      6     7
New York        8    9     10    11

In [113]:
data.rename(index = str.upper , columns = str.title)

          One  Two  Three  Four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [120]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
df = pd.DataFrame(ages)

In [121]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.841863 -0.559624
1    a  two -1.511548 -2.579797
2    b  one -1.331696  0.756763
3    b  two  0.568415  0.611527
4    a  one  0.549219  1.147803

In [135]:
grouped = df['data1'].groupby(df['key1'])

In [136]:
grouped.mean()

key1
a   -0.934731
b   -0.381640
Name: data1, dtype: float64

In [155]:
dates = pd.date_range('20191103', periods = 6)
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = list('ABCD'))

In [160]:
df[2:3]

                   A         B         C         D
2019-11-05  0.533005  0.708486  2.249419  1.844268

In [162]:
df.query('A > B')

                   A         B         C        D
2019-11-06  0.640565  0.274930  0.266880 -0.07529
2019-11-07  0.701366  0.444597  0.838034 -0.86019